espressif/esp-idf/examples/bluetooth/esp_ble_mesh/wifi_coexist/sdkconfig.defaults.esp32
# Override some defaults so BT stack is enabled
# by default in this example
CONFIG_IDF_TARGET="esp32"
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODEM_SLEEP=n
CONFIG_BTDM_SCAN_DUPL_TYPE_DATA_DEVICE=y
CONFIG_BTDM_BLE_MESH_SCAN_DUPL_EN=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
